lebakassemmerl/msp432-cpp/msp432p4xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>EUSCI_B2</name>
        <version>356.0</version>
        <description>EUSCI_B2</description>
        <baseAddress>0x40002800</baseAddress>
        <interrupt>
            <name>EUSCIB2_IRQ</name>
            <description>EUSCIB2 Interrupt</description>
            <value>22</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x30</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>UCBxCTLW0</name>
                  <displayName>CTLW0</displayName>
                  <description>eUSCI_Bx Control Word Register 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x000001c1</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCSWRST</name>
                        <description>Software reset enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSWRST_0</name>
                                <description>Disabled. eUSCI_B reset released for operation</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSWRST_1</name>
                                <description>Enabled. eUSCI_B logic held in reset state</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXSTT</name>
                        <description>Transmit START condition in master mode</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXSTT_0</name>
                                <description>Do not generate START condition</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXSTT_1</name>
                                <description>Generate START condition</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXSTP</name>
                        <description>Transmit STOP condition in master mode</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXSTP_0</name>
                                <description>No STOP generated</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXSTP_1</name>
                                <description>Generate STOP</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXNACK</name>
                        <description>Transmit a NACK</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXNACK_0</name>
                                <description>Acknowledge normally</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXNACK_1</name>
                                <description>Generate NACK</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTR</name>
                        <description>Transmitter/receiver</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTR_0</name>
                                <description>Receiver</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTR_1</name>
                                <description>Transmitter</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXACK</name>
                        <description>Transmit ACK condition in slave mode</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXACK_0</name>
                                <description>Do not acknowledge the slave address</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXACK_1</name>
                                <description>Acknowledge the slave address</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSSEL</name>
                        <description>eUSCI_B clock source select</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSSEL_0</name>
                                <description>UCLKI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSSEL_1</name>
                                <description>ACLK</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSSEL_2</name>
                                <description>SMCLK</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSSEL_3</name>
                                <description>SMCLK</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSYNC</name>
                        <description>Synchronous mode enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSYNC_0</name>
                                <description>Asynchronous mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSYNC_1</name>
                                <description>Synchronous mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCMODE</name>
                        <description>eUSCI_B mode</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCMODE_0</name>
                                <description>3-pin SPI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMODE_1</name>
                                <description>4-pin SPI (master or slave enabled if STE = 1)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMODE_2</name>
                                <description>4-pin SPI (master or slave enabled if STE = 0)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMODE_3</name>
                                <description>I2C mode</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCMST</name>
                        <description>Master mode select</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCMST_0</name>
                                <description>Slave mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMST_1</name>
                                <description>Master mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCMM</name>
                        <description>Multi-master environment select</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCMM_0</name>
                                <description>Single master environment. There is no other master in the system. The address compare unit is disabled.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMM_1</name>
                                <description>Multi-master environment</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSLA10</name>
                        <description>Slave addressing mode select</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSLA10_0</name>
                                <description>Address slave with 7-bit address</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSLA10_1</name>
                                <description>Address slave with 10-bit address</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCA10</name>
                        <description>Own addressing mode select</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCA10_0</name>
                                <description>Own address is a 7-bit address</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCA10_1</name>
                                <description>Own address is a 10-bit address</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxCTLW1</name>
                  <displayName>CTLW1</displayName>
                  <description>eUSCI_Bx Control Word Register 1</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000003</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCGLIT</name>
                        <description>Deglitch time</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCGLIT_0</name>
                                <description>50 ns</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGLIT_1</name>
                                <description>25 ns</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGLIT_2</name>
                                <description>12.5 ns</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGLIT_3</name>
                                <description>6.25 ns</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCASTP</name>
                        <description>Automatic STOP condition generation</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCASTP_0</name>
                                <description>No automatic STOP generation. The STOP condition is generated after the user sets the UCTXSTP bit. The value in UCBxTBCNT is a don't care.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCASTP_1</name>
                                <description>UCBCNTIFG is set with the byte counter reaches the threshold defined in UCBxTBCNT</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCASTP_2</name>
                                <description>A STOP condition is generated automatically after the byte counter value reached UCBxTBCNT. UCBCNTIFG is set with the byte counter reaching the threshold</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSWACK</name>
                        <description>SW or HW ACK control</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSWACK_0</name>
                                <description>The address acknowledge of the slave is controlled by the eUSCI_B module</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSWACK_1</name>
                                <description>The user needs to trigger the sending of the address ACK by issuing UCTXACK</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSTPNACK</name>
                        <description>ACK all master bytes</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSTPNACK_0</name>
                                <description>Send a non-acknowledge before the STOP condition as a master receiver (conform to I2C standard)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSTPNACK_1</name>
                                <description>All bytes are acknowledged by the eUSCI_B when configured as master receiver</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCCLTO</name>
                        <description>Clock low timeout select</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCCLTO_0</name>
                                <description>Disable clock low timeout counter</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCCLTO_1</name>
                                <description>135 000 SYSCLK cycles (approximately 28 ms)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCCLTO_2</name>
                                <description>150 000 SYSCLK cycles (approximately 31 ms)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCCLTO_3</name>
                                <description>165 000 SYSCLK cycles (approximately 34 ms)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCETXINT</name>
                        <description>Early UCTXIFG0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCETXINT_0</name>
                                <description>UCTXIFGx is set after an address match with UCxI2COAx and the direction bit indicating slave transmit</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCETXINT_1</name>
                                <description>UCTXIFG0 is set for each START condition</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
