lebakassemmerl/msp432-cpp/msp432p4xx.svd
            <register>
                  <name>CExCTL2</name>
                  <displayName>CTL2</displayName>
                  <description>Comparator Control Register 2</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CEREF0</name>
                        <description>Reference resistor tap 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEREF0_0</name>
                                <description>Reference resistor tap for setting 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_1</name>
                                <description>Reference resistor tap for setting 1.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_2</name>
                                <description>Reference resistor tap for setting 2.</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_3</name>
                                <description>Reference resistor tap for setting 3.</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_4</name>
                                <description>Reference resistor tap for setting 4.</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_5</name>
                                <description>Reference resistor tap for setting 5.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_6</name>
                                <description>Reference resistor tap for setting 6.</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_7</name>
                                <description>Reference resistor tap for setting 7.</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_8</name>
                                <description>Reference resistor tap for setting 8.</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_9</name>
                                <description>Reference resistor tap for setting 9.</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_10</name>
                                <description>Reference resistor tap for setting 10.</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_11</name>
                                <description>Reference resistor tap for setting 11.</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_12</name>
                                <description>Reference resistor tap for setting 12.</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_13</name>
                                <description>Reference resistor tap for setting 13.</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_14</name>
                                <description>Reference resistor tap for setting 14.</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_15</name>
                                <description>Reference resistor tap for setting 15.</description>
                                <value>15</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_16</name>
                                <description>Reference resistor tap for setting 16.</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_17</name>
                                <description>Reference resistor tap for setting 17.</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_18</name>
                                <description>Reference resistor tap for setting 18.</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_19</name>
                                <description>Reference resistor tap for setting 19.</description>
                                <value>19</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_20</name>
                                <description>Reference resistor tap for setting 20.</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_21</name>
                                <description>Reference resistor tap for setting 21.</description>
                                <value>21</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_22</name>
                                <description>Reference resistor tap for setting 22.</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_23</name>
                                <description>Reference resistor tap for setting 23.</description>
                                <value>23</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_24</name>
                                <description>Reference resistor tap for setting 24.</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_25</name>
                                <description>Reference resistor tap for setting 25.</description>
                                <value>25</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_26</name>
                                <description>Reference resistor tap for setting 26.</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_27</name>
                                <description>Reference resistor tap for setting 27.</description>
                                <value>27</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_28</name>
                                <description>Reference resistor tap for setting 28.</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_29</name>
                                <description>Reference resistor tap for setting 29.</description>
                                <value>29</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_30</name>
                                <description>Reference resistor tap for setting 30.</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF0_31</name>
                                <description>Reference resistor tap for setting 31.</description>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CERSEL</name>
                        <description>Reference select</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CERSEL_0</name>
                                <description>When CEEX = 0, VREF is applied to the V+ terminal; When CEEX = 1, VREF is applied to the V- terminal</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERSEL_1</name>
                                <description>When CEEX = 0, VREF is applied to the V- terminal; When CEEX = 1, VREF is applied to the V+ terminal</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CERS</name>
                        <description>Reference source</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CERS_0</name>
                                <description>No current is drawn by the reference circuitry</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERS_1</name>
                                <description>VCC applied to the resistor ladder</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERS_2</name>
                                <description>Shared reference voltage applied to the resistor ladder</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERS_3</name>
                                <description>Shared reference voltage supplied to V(CREF). Resistor ladder is off</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEREF1</name>
                        <description>Reference resistor tap 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEREF1_0</name>
                                <description>Reference resistor tap for setting 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_1</name>
                                <description>Reference resistor tap for setting 1.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_2</name>
                                <description>Reference resistor tap for setting 2.</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_3</name>
                                <description>Reference resistor tap for setting 3.</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_4</name>
                                <description>Reference resistor tap for setting 4.</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_5</name>
                                <description>Reference resistor tap for setting 5.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_6</name>
                                <description>Reference resistor tap for setting 6.</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_7</name>
                                <description>Reference resistor tap for setting 7.</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_8</name>
                                <description>Reference resistor tap for setting 8.</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_9</name>
                                <description>Reference resistor tap for setting 9.</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_10</name>
                                <description>Reference resistor tap for setting 10.</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_11</name>
                                <description>Reference resistor tap for setting 11.</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_12</name>
                                <description>Reference resistor tap for setting 12.</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_13</name>
                                <description>Reference resistor tap for setting 13.</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_14</name>
                                <description>Reference resistor tap for setting 14.</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_15</name>
                                <description>Reference resistor tap for setting 15.</description>
                                <value>15</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_16</name>
                                <description>Reference resistor tap for setting 16.</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_17</name>
                                <description>Reference resistor tap for setting 17.</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_18</name>
                                <description>Reference resistor tap for setting 18.</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_19</name>
                                <description>Reference resistor tap for setting 19.</description>
                                <value>19</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_20</name>
                                <description>Reference resistor tap for setting 20.</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_21</name>
                                <description>Reference resistor tap for setting 21.</description>
                                <value>21</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_22</name>
                                <description>Reference resistor tap for setting 22.</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_23</name>
                                <description>Reference resistor tap for setting 23.</description>
                                <value>23</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_24</name>
                                <description>Reference resistor tap for setting 24.</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_25</name>
                                <description>Reference resistor tap for setting 25.</description>
                                <value>25</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_26</name>
                                <description>Reference resistor tap for setting 26.</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_27</name>
                                <description>Reference resistor tap for setting 27.</description>
                                <value>27</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_28</name>
                                <description>Reference resistor tap for setting 28.</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_29</name>
                                <description>Reference resistor tap for setting 29.</description>
                                <value>29</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_30</name>
                                <description>Reference resistor tap for setting 30.</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREF1_31</name>
                                <description>Reference resistor tap for setting 31.</description>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEREFL</name>
                        <description>Reference voltage level</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEREFL_0</name>
                                <description>Reference amplifier is disabled. No reference voltage is requested</description>
                                <value>0</value>
                            </enumeratedValue>
