lebakassemmerl/msp432-cpp/msp432p4xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>RTC_C</name>
        <version>356.0</version>
        <description>RTC_C</description>
        <baseAddress>0x40004400</baseAddress>
        <interrupt>
            <name>RTC_C_IRQ</name>
            <description>RTC_C Interrupt</description>
            <value>29</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>RTCCTL0</name>
                  <displayName>CTL0</displayName>
                  <description>RTCCTL0 Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00009608</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RTCRDYIFG</name>
                        <description>Real-time clock ready interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCRDYIFG_0</name>
                                <description>RTC cannot be read safely</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCRDYIFG_1</name>
                                <description>RTC can be read safely</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCAIFG</name>
                        <description>Real-time clock alarm interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCAIFG_0</name>
                                <description>No time event occurred</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCAIFG_1</name>
                                <description>Time event occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCTEVIFG</name>
                        <description>Real-time clock time event interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCTEVIFG_0</name>
                                <description>No time event occurred</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTEVIFG_1</name>
                                <description>Time event occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCOFIFG</name>
                        <description>32-kHz crystal oscillator fault interrupt flag</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCOFIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCOFIFG_1</name>
                                <description>Interrupt pending. A 32-kHz crystal oscillator fault occurred after last reset.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCRDYIE</name>
                        <description>Real-time clock ready interrupt enable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCRDYIE_0</name>
                                <description>Interrupt not enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCRDYIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCAIE</name>
                        <description>Real-time clock alarm interrupt enable</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCAIE_0</name>
                                <description>Interrupt not enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCAIE_1</name>
                                <description>Interrupt enabled (LPM3/LPM3.5 wake-up enabled)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCTEVIE</name>
                        <description>Real-time clock time event interrupt enable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCTEVIE_0</name>
                                <description>Interrupt not enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTEVIE_1</name>
                                <description>Interrupt enabled (LPM3/LPM3.5 wake-up enabled)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCOFIE</name>
                        <description>32-kHz crystal oscillator fault interrupt enable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCOFIE_0</name>
                                <description>Interrupt not enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCOFIE_1</name>
                                <description>Interrupt enabled (LPM3/LPM3.5 wake-up enabled)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCKEY</name>
                        <description>Real-time clock key</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCCTL13</name>
                  <displayName>CTL13</displayName>
                  <description>RTCCTL13 Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000070</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RTCTEV</name>
                        <description>Real-time clock time event</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCTEV_0</name>
                                <description>Minute changed</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTEV_1</name>
                                <description>Hour changed</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTEV_2</name>
                                <description>Every day at midnight (00:00)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTEV_3</name>
                                <description>Every day at noon (12:00)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCSSEL</name>
                        <description>Real-time clock source select</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCSSEL_0</name>
                                <description>BCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCRDY</name>
                        <description>Real-time clock ready</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>RTCRDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>RTCRDY_0</name>
                                <description>RTC time values in transition</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCRDY_1</name>
                                <description>RTC time values safe for reading. This bit indicates when the real-time clock time values are safe for reading.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCMODE</name>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>RTCMODE_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>RTCMODE_1</name>
                                <description>Calendar mode. Always reads a value of 1.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCHOLD</name>
                        <description>Real-time clock hold</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCHOLD_0</name>
                                <description>Real-time clock is operational</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCHOLD_1</name>
                                <description>When set, the calendar is stopped as well as the prescale counters, RT0PS and RT1PS are don't care</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCBCD</name>
                        <description>Real-time clock BCD select</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCBCD_0</name>
                                <description>Binary (hexadecimal) code selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCBCD_1</name>
                                <description>Binary coded decimal (BCD) code selected</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCCALF</name>
                        <description>Real-time clock calibration frequency</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCCALF_0</name>
                                <description>No frequency output to RTCCLK pin</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCCALF_1</name>
                                <description>512 Hz</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCCALF_2</name>
                                <description>256 Hz</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCCALF_3</name>
                                <description>1 Hz</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCOCAL</name>
                  <displayName>OCAL</displayName>
                  <description>RTCOCAL Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RTCOCAL</name>
                        <description>Real-time clock offset error calibration</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RTCOCALS</name>
                        <description>Real-time clock offset error calibration sign</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCOCALS_0</name>
                                <description>Down calibration. Frequency adjusted down.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCOCALS_1</name>
                                <description>Up calibration. Frequency adjusted up.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCTCMP</name>
                  <displayName>TCMP</displayName>
                  <description>RTCTCMP Register</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00004000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RTCTCMP</name>
                        <description>Real-time clock temperature compensation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RTCTCOK</name>
                        <description>Real-time clock temperature compensation write OK</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>RTCTCOK_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>RTCTCOK_0</name>
                                <description>Write to RTCTCMPx is unsuccessful</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTCOK_1</name>
                                <description>Write to RTCTCMPx is successful</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTCTCRDY</name>
                        <description>Real-time clock temperature compensation ready</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RTCTCMPS</name>
                        <description>Real-time clock temperature compensation sign</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RTCTCMPS_0</name>
                                <description>Down calibration. Frequency adjusted down</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCTCMPS_1</name>
                                <description>Up calibration. Frequency adjusted up</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
