lebakassemmerl/msp432-cpp/msp432p4xx.svd
            <register>
                  <name>T32BGLOAD2</name>
                  <displayName>BGLOAD2</displayName>
                  <description>Timer 2 Background Load Register</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BGLOAD</name>
                        <description>Value from which the counter decrements</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>DMA</name>
        <version>356.0</version>
        <description>DMA</description>
        <baseAddress>0x4000E000</baseAddress>
        <interrupt>
            <name>DMA_ERR_IRQ</name>
            <description>DMA_ERR Interrupt</description>
            <value>30</value>
        </interrupt>
        <interrupt>
            <name>DMA_INT3_IRQ</name>
            <description>DMA_INT3 Interrupt</description>
            <value>31</value>
        </interrupt>
        <interrupt>
            <name>DMA_INT2_IRQ</name>
            <description>DMA_INT2 Interrupt</description>
            <value>32</value>
        </interrupt>
        <interrupt>
            <name>DMA_INT1_IRQ</name>
            <description>DMA_INT1 Interrupt</description>
            <value>33</value>
        </interrupt>
        <interrupt>
            <name>DMA_INT0_IRQ</name>
            <description>DMA_INT0 Interrupt</description>
            <value>34</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1050</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>DMA_DEVICE_CFG</name>
                  <displayName>DEVICE_CFG</displayName>
                  <description>Device Configuration Status</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffff0000</resetMask>
                  <fields>
                    <field>
                        <name>NUM_DMA_CHANNELS</name>
                        <description>Number of DMA channels available</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUM_SRC_PER_CHANNEL</name>
                        <description>Number of DMA sources per channel</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_SW_CHTRIG</name>
                  <displayName>SW_CHTRIG</displayName>
                  <description>Software Channel Trigger Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CH0</name>
                        <description>Write 1, triggers DMA_CHANNEL0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <description>Write 1, triggers DMA_CHANNEL1</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <description>Write 1, triggers DMA_CHANNEL2</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <description>Write 1, triggers DMA_CHANNEL3</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <description>Write 1, triggers DMA_CHANNEL4</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <description>Write 1, triggers DMA_CHANNEL5</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <description>Write 1, triggers DMA_CHANNEL6</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <description>Write 1, triggers DMA_CHANNEL7</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <description>Write 1, triggers DMA_CHANNEL8</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <description>Write 1, triggers DMA_CHANNEL9</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <description>Write 1, triggers DMA_CHANNEL10</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH11</name>
                        <description>Write 1, triggers DMA_CHANNEL11</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH12</name>
                        <description>Write 1, triggers DMA_CHANNEL12</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH13</name>
                        <description>Write 1, triggers DMA_CHANNEL13</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH14</name>
                        <description>Write 1, triggers DMA_CHANNEL14</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH15</name>
                        <description>Write 1, triggers DMA_CHANNEL15</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH16</name>
                        <description>Write 1, triggers DMA_CHANNEL16</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH17</name>
                        <description>Write 1, triggers DMA_CHANNEL17</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH18</name>
                        <description>Write 1, triggers DMA_CHANNEL18</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH19</name>
                        <description>Write 1, triggers DMA_CHANNEL19</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH20</name>
                        <description>Write 1, triggers DMA_CHANNEL20</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH21</name>
                        <description>Write 1, triggers DMA_CHANNEL21</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH22</name>
                        <description>Write 1, triggers DMA_CHANNEL22</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH23</name>
                        <description>Write 1, triggers DMA_CHANNEL23</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH24</name>
                        <description>Write 1, triggers DMA_CHANNEL24</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH25</name>
                        <description>Write 1, triggers DMA_CHANNEL25</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH26</name>
                        <description>Write 1, triggers DMA_CHANNEL26</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH27</name>
                        <description>Write 1, triggers DMA_CHANNEL27</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH28</name>
                        <description>Write 1, triggers DMA_CHANNEL28</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH29</name>
                        <description>Write 1, triggers DMA_CHANNEL29</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH30</name>
                        <description>Write 1, triggers DMA_CHANNEL30</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH31</name>
                        <description>Write 1, triggers DMA_CHANNEL31</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>32</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                  <name>DMA_CH_SRCCFG[%s]</name>
                  <displayName>CH_SRCCFG[%s]</displayName>
                  <description>Channel n Source Configuration Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DMA_SRC</name>
                        <description>Device level DMA source mapping to channel input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_INT1_SRCCFG</name>
                  <displayName>INT1_SRCCFG</displayName>
                  <description>Interrupt 1 Source Channel Configuration</description>
                  <addressOffset>0x100</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>INT_SRC</name>
                        <description>Controls which channel's completion event is mapped as a source of this Interrupt</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enables DMA_INT1 mapping</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_INT2_SRCCFG</name>
                  <displayName>INT2_SRCCFG</displayName>
                  <description>Interrupt 2 Source Channel Configuration Register</description>
                  <addressOffset>0x104</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>INT_SRC</name>
                        <description>Controls which channel's completion event is mapped as a source of this Interrupt</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enables DMA_INT2 mapping</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_INT3_SRCCFG</name>
                  <displayName>INT3_SRCCFG</displayName>
                  <description>Interrupt 3 Source Channel Configuration Register</description>
                  <addressOffset>0x108</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>INT_SRC</name>
                        <description>Controls which channel's completion event is mapped as a source of this Interrupt</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enables DMA_INT3 mapping</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
