lebakassemmerl/msp432-cpp/msp432p4xx.svd
            <register>
                  <name>CSCTL3</name>
                  <displayName>CTL3</displayName>
                  <description>Control 3 Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000bbb</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>FCNTLF</name>
                        <description>Start flag counter for LFXT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FCNTLF_0</name>
                                <description>4096 cycles</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTLF_1</name>
                                <description>8192 cycles</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTLF_2</name>
                                <description>16384 cycles</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTLF_3</name>
                                <description>32768 cycles</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RFCNTLF</name>
                        <description>Reset start fault counter for LFXT</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>RFCNTLF_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>RFCNTLF_0</name>
                                <description>Not applicable. Always reads as zero due to self clearing.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RFCNTLF_1</name>
                                <description>Restarts the counter immediately.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTLF_EN</name>
                        <description>Enable start fault counter for LFXT</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FCNTLF_EN_0</name>
                                <description>Startup fault counter disabled. Counter is cleared.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTLF_EN_1</name>
                                <description>Startup fault counter enabled.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTHF</name>
                        <description>Start flag counter for HFXT</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FCNTHF_0</name>
                                <description>2048 cycles</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF_1</name>
                                <description>4096 cycles</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF_2</name>
                                <description>8192 cycles</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF_3</name>
                                <description>16384 cycles</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RFCNTHF</name>
                        <description>Reset start fault counter for HFXT</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>RFCNTHF_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>RFCNTHF_0</name>
                                <description>Not applicable. Always reads as zero due to self clearing.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RFCNTHF_1</name>
                                <description>Restarts the counter immediately.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTHF_EN</name>
                        <description>Enable start fault counter for HFXT</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FCNTHF_EN_0</name>
                                <description>Startup fault counter disabled. Counter is cleared.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF_EN_1</name>
                                <description>Startup fault counter enabled.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTHF2</name>
                        <description>Start flag counter for HFXT2</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FCNTHF2_0</name>
                                <description>2048 cycles</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF2_1</name>
                                <description>4096 cycles</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF2_2</name>
                                <description>8192 cycles</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF2_3</name>
                                <description>16384 cycles</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RFCNTHF2</name>
                        <description>Reset start fault counter for HFXT2</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>RFCNTHF2_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>RFCNTHF2_0</name>
                                <description>Not applicable. Always reads as zero due to self clearing.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RFCNTHF2_1</name>
                                <description>Restarts the counter immediately.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTHF2_EN</name>
                        <description>Enable start fault counter for HFXT2</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FCNTHF2_EN_0</name>
                                <description>Startup fault counter disabled. Counter is cleared.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF2_EN_1</name>
                                <description>Startup fault counter enabled.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CSCLKEN</name>
                  <displayName>CLKEN</displayName>
                  <description>Clock Enable Register</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x0000000f</resetValue>
                  <resetMask>0xffff847f</resetMask>
                  <fields>
                    <field>
                        <name>ACLK_EN</name>
                        <description>ACLK system clock conditional request enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ACLK_EN_0</name>
                                <description>ACLK disabled regardless of conditional clock requests</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACLK_EN_1</name>
                                <description>ACLK enabled based on any conditional clock requests</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MCLK_EN</name>
                        <description>MCLK system clock conditional request enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MCLK_EN_0</name>
                                <description>MCLK disabled regardless of conditional clock requests</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MCLK_EN_1</name>
                                <description>MCLK enabled based on any conditional clock requests</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HSMCLK_EN</name>
                        <description>HSMCLK system clock conditional request enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HSMCLK_EN_0</name>
                                <description>HSMCLK disabled regardless of conditional clock requests</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HSMCLK_EN_1</name>
                                <description>HSMCLK enabled based on any conditional clock requests</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SMCLK_EN</name>
                        <description>SMCLK system clock conditional request enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SMCLK_EN_0</name>
                                <description>SMCLK disabled regardless of conditional clock requests.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SMCLK_EN_1</name>
                                <description>SMCLK enabled based on any conditional clock requests</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VLO_EN</name>
                        <description>Turns on the VLO oscillator</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VLO_EN_0</name>
                                <description>VLO is on only if it is used as a source for ACLK, MCLK, HSMCLK or SMCLK.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VLO_EN_1</name>
                                <description>VLO is on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFO_EN</name>
                        <description>Turns on the REFO oscillator</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFO_EN_0</name>
                                <description>REFO is on only if it is used as a source for ACLK, MCLK, HSMCLK or SMCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFO_EN_1</name>
                                <description>REFO is on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MODOSC_EN</name>
                        <description>Turns on the MODOSC oscillator</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MODOSC_EN_0</name>
                                <description>MODOSC is on only if it is used as a source for ACLK, MCLK, HSMCLK or SMCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODOSC_EN_1</name>
                                <description>MODOSC is on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFOFSEL</name>
                        <description>Selects REFO nominal frequency</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFOFSEL_0</name>
                                <description>32 kHz</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFOFSEL_1</name>
                                <description>128 kHz</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
