lebakassemmerl/msp432-cpp/msp432p4xx.svd
            <register>
                  <name>ADC14IER0</name>
                  <displayName>IER0</displayName>
                  <description>Interrupt Enable 0 Register</description>
                  <addressOffset>0x13C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14IE0</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE0_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE0_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE1</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE1_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE1_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE2</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE2_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE2_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE3</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE3_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE3_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE4</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE4_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE4_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE5</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE5_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE5_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE6</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE6_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE6_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE7</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE7_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE7_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE8</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE8_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE8_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE9</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE9_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE9_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE10</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE10_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE10_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE11</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE11_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE11_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE12</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE12_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE12_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE13</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE13_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE13_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE14</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE14_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE14_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE15</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE15_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE15_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE16</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE16_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE16_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE17</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE17_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE17_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE19</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE19_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE19_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE18</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE18_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE18_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE20</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE20_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE20_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE21</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE21_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE21_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE22</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE22_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE22_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IE23</name>
                        <description>Interrupt enable</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IE23_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IE23_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
