lebakassemmerl/msp432-cpp/msp432p4xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>RSTCTL</name>
        <version>356.0</version>
        <description>RSTCTL</description>
        <baseAddress>0xE0042000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x128</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>RSTCTL_RESET_REQ</name>
                  <displayName>RESET_REQ</displayName>
                  <description>Reset Request Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffff00fc</resetMask>
                  <fields>
                    <field>
                        <name>SOFT_REQ</name>
                        <description>Soft Reset request</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>HARD_REQ</name>
                        <description>Hard Reset request</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>RSTKEY</name>
                        <description>Write key to unlock reset request bits</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_HARDRESET_STAT</name>
                  <displayName>HARDRESET_STAT</displayName>
                  <description>Hard Reset Status Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SRC0</name>
                        <description>Indicates that SRC0 was the source of the Hard Reset</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC1</name>
                        <description>Indicates that SRC1 was the source of the Hard Reset</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC2</name>
                        <description>Indicates that SRC2 was the source of the Hard Reset</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC3</name>
                        <description>Indicates that SRC3 was the source of the Hard Reset</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC4</name>
                        <description>Indicates that SRC4 was the source of the Hard Reset</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC5</name>
                        <description>Indicates that SRC5 was the source of the Hard Reset</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC6</name>
                        <description>Indicates that SRC6 was the source of the Hard Reset</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC7</name>
                        <description>Indicates that SRC7 was the source of the Hard Reset</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC8</name>
                        <description>Indicates that SRC8 was the source of the Hard Reset</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC9</name>
                        <description>Indicates that SRC9 was the source of the Hard Reset</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC10</name>
                        <description>Indicates that SRC10 was the source of the Hard Reset</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC11</name>
                        <description>Indicates that SRC11 was the source of the Hard Reset</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC12</name>
                        <description>Indicates that SRC12 was the source of the Hard Reset</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC13</name>
                        <description>Indicates that SRC13 was the source of the Hard Reset</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC14</name>
                        <description>Indicates that SRC14 was the source of the Hard Reset</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SRC15</name>
                        <description>Indicates that SRC15 was the source of the Hard Reset</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_HARDRESET_CLR</name>
                  <displayName>HARDRESET_CLR</displayName>
                  <description>Hard Reset Status Clear Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffff0000</resetMask>
                  <fields>
                    <field>
                        <name>SRC0</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC1</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC2</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC3</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC4</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC5</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC6</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC7</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC8</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC9</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC10</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC11</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC12</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC13</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC14</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_STAT</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC15</name>
                        <description>Write 1 clears the corresponding bit in the RSTCTL_HRDRESETSTAT_REG</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_HARDRESET_SET</name>
                  <displayName>HARDRESET_SET</displayName>
                  <description>Hard Reset Status Set Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SRC0</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC1</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC2</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC3</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC4</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC5</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC6</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC7</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC8</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC9</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC10</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC11</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC12</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC13</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC14</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SRC15</name>
                        <description>Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT (and initiates a Hard Reset)</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
