lebakassemmerl/msp432-cpp/msp432p4xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SYSCTL</name>
        <version>356.0</version>
        <description>SYSCTL</description>
        <baseAddress>0xE0043000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1028</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>SYS_REBOOT_CTL</name>
                  <displayName>REBOOT_CTL</displayName>
                  <description>Reboot Control Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x000000fe</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>REBOOT</name>
                        <description>Write 1 initiates a Reboot of the device</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WKEY</name>
                        <description>Key to enable writes to bit 0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_NMI_CTLSTAT</name>
                  <displayName>NMI_CTLSTAT</displayName>
                  <description>NMI Control and Status Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000007</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CS_SRC</name>
                        <description>CS interrupt as a source of NMI</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CS_SRC_0</name>
                                <description>Disables CS interrupt as a source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CS_SRC_1</name>
                                <description>Enables CS interrupt as a source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSS_SRC</name>
                        <description>PSS interrupt as a source of NMI</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PSS_SRC_0</name>
                                <description>Disables the PSS interrupt as a source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSS_SRC_1</name>
                                <description>Enables the PSS interrupt as a source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PCM_SRC</name>
                        <description>PCM interrupt as a source of NMI</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PCM_SRC_0</name>
                                <description>Disbles the PCM interrupt as a source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PCM_SRC_1</name>
                                <description>Enables the PCM interrupt as a source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PIN_SRC</name>
                        <description>RSTn/NMI pin configuration
Note: When the device enters LPM3/LPM4 modes of operation, the functionality selected by this bit is retained. If selected as an NMI, activity on this pin in 
LPM3/LPM4 wakes the device and processes the interrupt, without causing a POR. If selected as a Reset, activity on this pin in LPM3/LPM4 causes a device-level POR
When the device enters LPM3.5/LPM4.5 modes of operation, this bit is always cleared to 0. In other words, the RSTn/NMI pin always assumes a reset functionality in LPM3.5/LPM4.5 modes.</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PIN_SRC_0</name>
                                <description>Configures the RSTn_NMI pin as a source of POR Class Reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIN_SRC_1</name>
                                <description>Configures the RSTn_NMI pin as a source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CS_FLG</name>
                        <description>CS interrupt was the source of NMI</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>CS_FLG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>CS_FLG_0</name>
                                <description>indicates CS interrupt was not the source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CS_FLG_1</name>
                                <description>indicates CS interrupt was the source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSS_FLG</name>
                        <description>PSS interrupt was the source of NMI</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>PSS_FLG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>PSS_FLG_0</name>
                                <description>indicates the PSS interrupt was not the source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSS_FLG_1</name>
                                <description>indicates the PSS interrupt was the source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PCM_FLG</name>
                        <description>PCM interrupt was the source of NMI</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>PCM_FLG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>PCM_FLG_0</name>
                                <description>indicates the PCM interrupt was not the source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PCM_FLG_1</name>
                                <description>indicates the PCM interrupt was the source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PIN_FLG</name>
                        <description>RSTn/NMI pin was the source of NMI</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PIN_FLG_0</name>
                                <description>Indicates the RSTn_NMI pin was not the source of NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIN_FLG_1</name>
                                <description>Indicates the RSTn_NMI pin was the source of NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_WDTRESET_CTL</name>
                  <displayName>WDTRESET_CTL</displayName>
                  <description>Watchdog Reset Control Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000003</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>TIMEOUT</name>
                        <description>WDT timeout reset type</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TIMEOUT_0</name>
                                <description>WDT timeout event generates Soft reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TIMEOUT_1</name>
                                <description>WDT timeout event generates Hard reset</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VIOLATION</name>
                        <description>WDT password violation reset type</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VIOLATION_0</name>
                                <description>WDT password violation event generates Soft reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VIOLATION_1</name>
                                <description>WDT password violation event generates Hard reset</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
