lebakassemmerl/msp432-cpp/msp432p4xx.svd
            <register>
                  <name>SYS_BOOTOVER_ACK</name>
                  <displayName>BOOTOVER_ACK</displayName>
                  <description>Boot Override Acknowledge Register</description>
                  <addressOffset>0x100C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>REGVAL</name>
                        <description>Value set by CPU, read/clear by the debugger</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_RESET_REQ</name>
                  <displayName>RESET_REQ</displayName>
                  <description>Reset Request Register</description>
                  <addressOffset>0x1010</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>POR</name>
                        <description>Generate POR</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>REBOOT</name>
                        <description>Generate Reboot_Reset</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>WKEY</name>
                        <description>Write key</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_RESET_STATOVER</name>
                  <displayName>RESET_STATOVER</displayName>
                  <description>Reset Status and Override Register</description>
                  <addressOffset>0x1014</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000700</resetMask>
                  <fields>
                    <field>
                        <name>SOFT</name>
                        <description>Indicates if SOFT Reset is active</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HARD</name>
                        <description>Indicates if HARD Reset is active</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REBOOT</name>
                        <description>Indicates if Reboot Reset is active</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SOFT_OVER</name>
                        <description>SOFT_Reset overwrite request</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HARD_OVER</name>
                        <description>HARD_Reset overwrite request</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RBT_OVER</name>
                        <description>Reboot Reset overwrite request</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SYSTEM_STAT</name>
                  <displayName>SYSTEM_STAT</displayName>
                  <description>System Status Register</description>
                  <addressOffset>0x1020</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>DBG_SEC_ACT</name>
                        <description>Debug Security active</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JTAG_SWD_LOCK_ACT</name>
                        <description>Indicates if JTAG and SWD Lock is active</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IP_PROT_ACT</name>
                        <description>Indicates if IP protection is active</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
   </peripherals>
</device>


